[{"title":"Wisdom for Software Development","blurb":"A collection of insights, quotes, and best practices.","description":"This page gathers a range of wisdom from various domains to inspire and guide software development.","domain":["Page"],"isHtml":false,"content":"no content"},{"title":"If it ain't pretty, it don't work","blurb":"Importance of UX design","description":"This highlights the importance of UX design and user-centric thinking. Usability and aesthetics can be critical to adoption and effective usage.","domain":["Design"],"isHtml":false,"content":"Usability and aesthetics are key to effective user engagement. Focusing on the user experience ensures that the product is not only functional but also enjoyable to use."},{"title":"Make it work, make it work better, make it generic","blurb":"Iterative approach to development","description":"This echoes the iterative approach to development, promoting incremental improvements and reusability, a core concept in software engineering.","domain":["Development"],"isHtml":false,"content":"An iterative process allows for continual refinement and enhancement, ensuring that the end product is both functional and efficient."},{"title":"No loops within loops, no I/O within loops","blurb":"Avoiding computationally expensive code","description":"A warning against computationally expensive code that could lead to performance issues.","domain":["Performance"],"isHtml":false,"content":"Writing efficient code is vital for performance, especially in resource-intensive applications. This principle warns against practices that can lead to sluggish performance."},{"title":"Don't fence me in","blurb":"Encourages autonomy and focuses on outcomes","description":"Encourages autonomy and focuses on outcomes over prescriptive methods, aligning with agile and modern management practices.","domain":["Management"],"isHtml":false,"content":"Focusing on results rather than methods allows for more creativity and innovation. This principle emphasizes flexibility and empowers teams to find the best path to success."},{"title":"A man's gotta think about the future","blurb":"Encourages foresight in design","description":"Encourages foresight in design, thinking about scalability and future changes without over-engineering.","domain":["Design"],"isHtml":false,"content":"Looking ahead to future needs helps create solutions that are adaptable and scalable. This principle promotes thoughtful planning that takes into account potential growth and change."},{"title":"Always get a second opinion","blurb":"Emphasizes collaboration and diverse perspectives","description":"Emphasizes collaboration and seeking diverse perspectives to avoid tunnel vision in design decisions.","domain":["Collaboration"],"isHtml":false,"content":"Working together and seeking various opinions can lead to more robust and well-rounded solutions. This principle encourages teamwork and recognizes the value of different perspectives."},{"title":"Where could I be going wrong?","blurb":"Promotes self-awareness and critical thinking","description":"Promotes self-awareness and critical thinking, encouraging a rigorous examination of assumptions.","domain":["Self-Improvement"],"isHtml":false,"content":"Being aware of potential pitfalls and constantly questioning one's approach leads to more thoughtful and effective solutions. This principle fosters continuous improvement and personal growth."},{"title":"What is the thing that it is?","blurb":"Importance of deep understanding of the domain","description":"Stresses the importance of a deep understanding of the domain, key to creating adaptable and relevant solutions.","domain":["Analysis"],"isHtml":false,"content":"Truly understanding the core of a problem or system is essential for creating solutions that are not only effective now but also adaptable in the future. This principle encourages thorough analysis and insight."},{"title":"Don't jump to solutions","blurb":"Encourages a thoughtful approach","description":"Encourages a thoughtful and methodical approach to problem-solving rather than diving into coding without proper analysis.","domain":["Problem-Solving"],"isHtml":false,"content":"Taking the time to thoroughly analyze a problem before jumping into a solution ensures that the solution is well thought out and more likely to succeed."},{"title":"The easy way is the most expensive","blurb":"Shortcuts often lead to problems","description":"Reminds us that shortcuts and quick fixes often lead to technical debt and more significant problems down the road.","domain":["Best Practices"],"isHtml":false,"content":"Choosing the easy path may seem appealing in the short term, but it often leads to more work and trouble later on. This principle encourages thoughtful and deliberate decision-making."},{"title":"A stitch in design saves nine","blurb":"Proper planning and design","description":"Echoes the wisdom of proper planning and design before implementation, aligning with preventive thinking in software development.","domain":["Design"],"isHtml":false,"content":"Investing time in planning and design can prevent problems later in the process. This principle emphasizes the importance of foresight and preparation."},{"title":"Monkey see, monkey do","blurb":"Follow established best practices","description":"Encourages the following of established best practices and learning from others' success.","domain":["Best Practices"],"isHtml":false,"content":"Learning from the success of others and adhering to proven methods can lead to more reliable results. This principle encourages the adoption of tried-and-true practices."},{"title":"Know thyself","blurb":"Self-awareness and personal growth","description":"Emphasizes self-awareness and personal growth as key to professional development.","domain":["Self-Improvement"],"isHtml":false,"content":"Understanding oneself, strengths, and weaknesses are essential for personal and professional growth. This principle fosters introspection and continuous improvement."},{"title":"What is the saying? know thyself or gnoti seuton?","blurb":"Encourages reflection and learning","description":"Encourages reflection and continuous learning, seeking wisdom, and understanding.","domain":["Wisdom"],"isHtml":false,"content":"Continual reflection and striving to learn and grow are essential for long-term success. This principle encourages an ongoing pursuit of wisdom and self-understanding."},{"title":"Don't go near there!","blurb":"Avoid anti-patterns","description":"Pay attention to lessons learned, avoid anti-patterns.","domain":["Best Practices"],"isHtml":false,"content":"Learning from past mistakes and avoiding common pitfalls is key to successful development. Recognizing and steering clear of anti-patterns can save time and effort in the long run."},{"title":"Page","blurb":"Essentials of Page Design and Layout","description":"This category focuses on the essentials of web page design and layout, including structure, responsiveness, and accessibility.","domain":["category:Page"],"isHtml":false,"content":"Well-designed pages enhance user experience and accessibility, making content easily digestible and navigation intuitive."},{"title":"Design","blurb":"Principles of UX and UI Design","description":"Design category emphasizes user-centric design principles, including aesthetics, usability, and interaction design.","domain":["category:Design"],"isHtml":false,"content":"Good design prioritizes the user's needs and creates an engaging and efficient interface."},{"title":"Development","blurb":"Software Development Methodologies","description":"Development focuses on methodologies, iterative approach, reusability, and core concepts in software engineering.","domain":["category:Development"],"isHtml":false,"content":"Effective development practices enable incremental improvements, ensuring a functional and efficient end product."},{"title":"Performance","blurb":"Optimizing Code for Performance","description":"This category covers strategies to avoid computationally expensive code and best practices for performance optimization.","domain":["category:Performance"],"isHtml":false,"content":"Performance is key to providing a smooth user experience and efficient resource utilization."},{"title":"Management","blurb":"Modern Management Practices","description":"Management category covers practices like autonomy, outcome focus, agile methodologies, and flexibility within teams.","domain":["category:Management"],"isHtml":false,"content":"Effective management enables creativity and innovation, emphasizing flexibility and the path to success."},{"title":"Collaboration","blurb":"Teamwork and Collaboration Strategies","description":"Collaboration emphasizes the importance of working together, seeking diverse perspectives, and value in teamwork.","domain":["category:Collaboration"],"isHtml":false,"content":"Collaboration fosters robust solutions, encouraging teamwork and harnessing various opinions."},{"title":"Self-Improvement","blurb":"Personal Growth and Professional Development","description":"This category focuses on self-awareness, critical thinking, personal growth, and continuous improvement.","domain":["category:Self-Improvement"],"isHtml":false,"content":"Investing in self-improvement leads to more effective solutions and fosters personal growth."},{"title":"Analysis","blurb":"Understanding and Analyzing Problems","description":"Analysis emphasizes the importance of deep understanding of the domain, adaptability, and relevance of solutions.","domain":["category:Analysis"],"isHtml":false,"content":"Thorough analysis leads to effective solutions that are adaptable and cater to future needs."},{"title":"Problem-Solving","blurb":"Methodical Approach to Problem-Solving","description":"Problem-Solving encourages a thoughtful approach, thorough analysis, and well-planned solutions.","domain":["category:Problem-Solving"],"isHtml":false,"content":"A strategic approach to problem-solving ensures well-considered and successful solutions."},{"title":"Best Practices","blurb":"Adhering to Industry Best Practices","description":"This category promotes following best practices, avoiding shortcuts, and learning from successful precedents.","domain":["category:Best Practices"],"isHtml":false,"content":"Adopting best practices leads to reliable results, minimizing technical debt and future complications."},{"title":"Wisdom","blurb":"Reflection, Wisdom, and Understanding","description":"Wisdom category emphasizes continuous reflection, learning, pursuit of wisdom, and self-understanding.","domain":["category:Wisdom"],"isHtml":true,"content":"<div> <p>Certainly! Here's the revised version with grammatical corrections:</p> <p> Retiring and Replacing a system can be reduced down to four essential phases: </p> <ol> <li>Understanding the Business Objectives</li> <li>Risk Remediation, Estimating &amp; Planning</li> <li>Construction, Integration, and Monitoring</li> <li>Retrospective & Continuous Improvement</li> </ol> <p> The process begins with obtaining a sufficient understanding of the business domain, understanding the shortfalls of the existing system, and the performance expectations for its replacement. Risks must be identified and evaluated. These risks may be technology, organization, or funding-based. Any Compliance or Mandate requirements are discovered. A sizing estimate of the complexity, feasibility, and resources needed to successfully complete the project enables stakeholders to evaluate if the value proposition is worth the cost. If all is acceptable, Stakeholder sign-offs are obtained. </p> <p> Risk Remediation, Estimating & Planning headlines the next phase. Unacceptable risks are addressed, often through working architectural prototypes that directly address the highest technology risks, and demonstrate architecture and design alignment with Domain E/R analysis, which reveals those aspects of the system that will likely be subject to frequent change over time. Plans are laid for the teams that will execute the construction, testing, and deployment of the well-designed solution. If data, user, or any other transformation or transition is contemplated, a Transition Plan is formulated with V&amp;V metrics and thresholds for reporting. Once again, Stakeholders review and approve the commencement of the next phase. </p> <p> Construction, Integration, and Monitoring make up the execution phase, where key activities of development, integration, testing, and transition are closely monitored. This phase is often executed in several segments that each may result in milestones and deliverables. The feedback loop between development, validation/QA testing, and even UAT is best kept tight, in order to fail fast and quickly adapt to inevitable challenges &amp; refinement of functional requirements. The loop completes upon final UAT acceptance and is followed by deployment to production for a period of monitoring and adjustment until it reaches a stable state. </p> <p> The final phase is to conduct a Retrospective involving all relevant stakeholders to highlight challenges faced, identify successes and failures, and create actionable recommendations for future projects. A valuable learning tool, the retrospective helps the organization grow and improve through the incorporation of recommendations into the process. The institutional knowledge gained reflects back as improved guidance for teams on future projects. </p> </div>"}]